DELETE FROM meals;
DELETE FROM user_roles;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (datetime, description, calories, user_id)
VALUES (TIMESTAMP '2021-10-16 01:21:00', 'Ночной дожор', 500, 100000),
       (TIMESTAMP '2021-10-16 10:01:00', 'Утренний обжор', 100, 100000),
       (TIMESTAMP '2021-10-16 13:01:00', 'Дневной дожор', 800, 100000),
       (TIMESTAMP '2021-10-16 20:01:00', 'Вечерний жвон', 500, 100000),
       (TIMESTAMP '2021-10-17 10:01:00', 'Завтрак', 500, 100000),
       (TIMESTAMP '2021-10-17 10:31:00', 'Кофе с собой', 100, 100000),
       (TIMESTAMP '2021-10-17 13:01:00', 'Обед', 1000, 100000),
       (TIMESTAMP '2021-10-17 20:01:00', 'Ужин', 500, 100000),
       (TIMESTAMP '2021-10-18 10:20:00', 'Завтрак', 500, 100001),
       (TIMESTAMP '2021-10-18 10:50:00', 'Кофе с собой', 100, 100001),
       (TIMESTAMP '2021-10-18 13:00:00', 'Обед', 800, 100001),
       (TIMESTAMP '2021-10-18 20:00:00', 'Ужин', 500, 100001),
       (TIMESTAMP '2021-10-19 10:00:00', 'Завтрак', 500, 100001),
       (TIMESTAMP '2021-10-19 10:30:00', 'Кофе с собой', 100, 100001),
       (TIMESTAMP '2021-10-19 13:00:00', 'Обед', 1000, 100001),
       (TIMESTAMP '2021-10-19 20:00:00', 'Ужин', 500, 100001),
       (TIMESTAMP '2021-10-20 10:00:00', 'Завтрак', 500, 100001),
       (TIMESTAMP '2021-10-20 13:00:00', 'Обед', 1000, 100001),
       (TIMESTAMP '2021-10-20 20:00:00', 'Ужин', 500, 100001),
       (TIMESTAMP '2021-10-21 00:00:00', 'Еда на граничное значение', 100, 100001),
       (TIMESTAMP '2021-10-21 10:00:00', 'Завтрак', 1000, 100001),
       (TIMESTAMP '2021-10-21 13:00:00', 'Обед', 500, 100001),
       (TIMESTAMP '2021-10-21 20:00:00', 'Ужин', 410, 100001);